In [25]:
import pandas as pd
import numpy as np

### Creating a dataframe

Creating a dictionary

In [26]:
dict_data = {
    'Age' :     [ 10, 9, 13, 14, 12, 11, 12],
    'Height' : [ 115, 110, 130, 155, 125, 120, 125],
    'Country' :  [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'Genre' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'Age': [10, 9, 13, 14, 12, 11, 12],
 'Height': [115, 110, 130, 155, 125, 120, 125],
 'Country': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'Genre': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

Creating a dataframe from the dict

In [27]:
dataFrame = pd.DataFrame(dict_data, index = ['Julian','Ana','Camila','Daniel','Fabian','Oscar','Gabriela'])
dataFrame

          Age  Height Country Genre    Q1   Q2
Julian     10     115      co     M   5.0  7.0
Ana         9     110      mx     F  10.0  9.0
Camila     13     130      co     F   8.0  9.0
Daniel     14     155      mx     M   NaN  8.0
Fabian     12     125      mx     M   7.0  8.0
Oscar      11     120      ch     M   8.0  8.0
Gabriela   12     125      ch     F   3.0  9.0

Looking the dataframe index

In [28]:
dataFrame.index

Index(['Julian', 'Ana', 'Camila', 'Daniel', 'Fabian', 'Oscar', 'Gabriela'], dtype='object')

Looking the dataframe columns

In [29]:
dataFrame.columns

Index(['Age', 'Height', 'Country', 'Genre', 'Q1', 'Q2'], dtype='object')

Looking the dataframe values

In [30]:
dataFrame.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

Sorting by key index

In [31]:
dataFrame['Age']

Julian      10
Ana          9
Camila      13
Daniel      14
Fabian      12
Oscar       11
Gabriela    12
Name: Age, dtype: int64

Sorting by more key index

In [32]:
dataFrame[['Age', 'Height', 'Q1']]

          Age  Height    Q1
Julian     10     115   5.0
Ana         9     110  10.0
Camila     13     130   8.0
Daniel     14     155   NaN
Fabian     12     125   7.0
Oscar      11     120   8.0
Gabriela   12     125   3.0

Using localitation

In [33]:
dataFrame.loc['Ana', ['Age', 'Height', 'Q1']]

Age          9
Height     110
Q1        10.0
Name: Ana, dtype: object

In [34]:
dataFrame.loc[['Ana', 'Gabriela'], ['Age', 'Height', 'Q1']]

          Age  Height    Q1
Ana         9     110  10.0
Gabriela   12     125   3.0

Using iloc

In [35]:
dataFrame.iloc[[4],2]

Fabian    mx
Name: Country, dtype: object

In [36]:
dataFrame.iloc[[2,4,5], [1,3]]

        Height Genre
Camila     130     F
Fabian     125     M
Oscar      120     M

Using conditionals for filter data

In [37]:
dataFrame['Age'] >= 12

Julian      False
Ana         False
Camila       True
Daniel       True
Fabian       True
Oscar       False
Gabriela     True
Name: Age, dtype: bool

In [38]:
dataFrame[dataFrame['Age'] >= 12]

          Age  Height Country Genre   Q1   Q2
Camila     13     130      co     F  8.0  9.0
Daniel     14     155      mx     M  NaN  8.0
Fabian     12     125      mx     M  7.0  8.0
Gabriela   12     125      ch     F  3.0  9.0

In [39]:
dataFrame[(dataFrame['Age'] >= 12) & (dataFrame['Country'] == 'mx')]

        Age  Height Country Genre   Q1   Q2
Daniel   14     155      mx     M  NaN  8.0
Fabian   12     125      mx     M  7.0  8.0

Using query for conditional search

In [40]:
dataFrame.query('Age > 12')

        Age  Height Country Genre   Q1   Q2
Camila   13     130      co     F  8.0  9.0
Daniel   14     155      mx     M  NaN  8.0

Search and show only one column of that search

In [41]:
dataFrame.query("(Age >= 12) & (Height < 130) & (Q1 > 5)")['Q2']

Fabian    8.0
Name: Q2, dtype: float64

Conditionals between columns

In [42]:
dataFrame[dataFrame['Q2'] >= dataFrame['Q1']]

          Age  Height Country Genre   Q1   Q2
Julian     10     115      co     M  5.0  7.0
Camila     13     130      co     F  8.0  9.0
Fabian     12     125      mx     M  7.0  8.0
Oscar      11     120      ch     M  8.0  8.0
Gabriela   12     125      ch     F  3.0  9.0